Alvax10/tp-final-ed3-TETRIS/CMSISv2p00_LPC17xx/Drivers/src/tft_ili9341.c
/**
 * @file tft_ili9341.c
 * @brief Implementación del driver TFT ILI9341 para LPC1769 via SSP0
 *
 * Capas:
 *  1. HAL SSP0       		– registros LPC_SSP0 del CMSIS LPC1769
 *  2. ILI9341        		– comandos del controlador, inicialización, ventana de dirección
 *  3. Primitive functions 	– drawPixel, líneas, rectángulos, círculos, texto
 */

#include "LPC17xx.h"   /* CMSIS — ajustar path según tu toolchain */
#include <stdlib.h>    /* abs() */
#include "tft_ili9341.h"
#include "tetris_display.h"

/* =========================================================
 *  Macros de GPIO
 * ========================================================= */

#define GPIO_SET(port, pin)   ((port)->FIOSET = (1u << (pin)))
#define GPIO_CLR(port, pin)   ((port)->FIOCLR = (1u << (pin)))
#define GPIO_OUT(port, pin)   ((port)->FIODIR |= (1u << (pin)))

#define TFT_CS_HIGH()   GPIO_SET(TFT_CS_PORT,  TFT_CS_PIN)
#define TFT_CS_LOW()    GPIO_CLR(TFT_CS_PORT,  TFT_CS_PIN)
#define TFT_DC_HIGH()   GPIO_SET(TFT_DC_PORT,  TFT_DC_PIN)   /* datos */
#define TFT_DC_LOW()    GPIO_CLR(TFT_DC_PORT,  TFT_DC_PIN)   /* comando */
#define TFT_RST_HIGH()  GPIO_SET(TFT_RST_PORT, TFT_RST_PIN)
#define TFT_RST_LOW()   GPIO_CLR(TFT_RST_PORT, TFT_RST_PIN)

/* =========================================================
 *  Comandos ILI9341
 * ========================================================= */

#define ILI9341_SWRESET     0x01
#define ILI9341_SLPOUT      0x11
#define ILI9341_DISPOFF     0x28
#define ILI9341_DISPON      0x29
#define ILI9341_CASET       0x2A   /* Column Address Set */
#define ILI9341_PASET       0x2B   /* Page (Row) Address Set */
#define ILI9341_RAMWR       0x2C   /* Memory Write */
#define ILI9341_MADCTL      0x36   /* Memory Access Control (rotación) */
#define ILI9341_COLMOD      0x3A   /* Pixel Format */
#define ILI9341_FRMCTR1     0xB1
#define ILI9341_DFUNCTR     0xB6
#define ILI9341_PWCTR1      0xC0
#define ILI9341_PWCTR2      0xC1
#define ILI9341_VMCTR1      0xC5
#define ILI9341_VMCTR2      0xC7
#define ILI9341_GMCTRP1     0xE0
#define ILI9341_GMCTRN1     0xE1
#define ILI9341_IFCTL       0xF6

/* Bits MADCTL para rotación */
#define MADCTL_MY   0x80
#define MADCTL_MX   0x40
#define MADCTL_MV   0x20
#define MADCTL_BGR  0x08

/* =========================================================
 *  Estado interno del driver
 * ========================================================= */

static uint16_t _width  = TFT_WIDTH;
static uint16_t _height = TFT_HEIGHT;
static tft_rotation_t _rotation = TFT_ROT_0;

/* =========================================================
 *  FUENTE 5×7 px  (ASCII 32 – 126)
 *  Cada columna es un byte; bit 0 = fila superior
 * ========================================================= */
const uint8_t tft_font5x7[95][5] = {
    {0x00,0x00,0x00,0x00,0x00}, /* ' ' */
    {0x00,0x00,0x5F,0x00,0x00}, /* '!' */
    {0x00,0x07,0x00,0x07,0x00}, /* '"' */
    {0x14,0x7F,0x14,0x7F,0x14}, /* '#' */
    {0x24,0x2A,0x7F,0x2A,0x12}, /* '$' */
    {0x23,0x13,0x08,0x64,0x62}, /* '%' */
    {0x36,0x49,0x55,0x22,0x50}, /* '&' */
    {0x00,0x05,0x03,0x00,0x00}, /* '\'' */
    {0x00,0x1C,0x22,0x41,0x00}, /* '(' */
    {0x00,0x41,0x22,0x1C,0x00}, /* ')' */
    {0x14,0x08,0x3E,0x08,0x14}, /* '*' */
    {0x08,0x08,0x3E,0x08,0x08}, /* '+' */
    {0x00,0x50,0x30,0x00,0x00}, /* ',' */
    {0x08,0x08,0x08,0x08,0x08}, /* '-' */
    {0x00,0x60,0x60,0x00,0x00}, /* '.' */
    {0x20,0x10,0x08,0x04,0x02}, /* '/' */
    {0x3E,0x51,0x49,0x45,0x3E}, /* '0' */
    {0x00,0x42,0x7F,0x40,0x00}, /* '1' */
    {0x42,0x61,0x51,0x49,0x46}, /* '2' */
    {0x21,0x41,0x45,0x4B,0x31}, /* '3' */
    {0x18,0x14,0x12,0x7F,0x10}, /* '4' */
    {0x27,0x45,0x45,0x45,0x39}, /* '5' */
    {0x3C,0x4A,0x49,0x49,0x30}, /* '6' */
    {0x01,0x71,0x09,0x05,0x03}, /* '7' */
    {0x36,0x49,0x49,0x49,0x36}, /* '8' */
    {0x06,0x49,0x49,0x29,0x1E}, /* '9' */
    {0x00,0x36,0x36,0x00,0x00}, /* ':' */
    {0x00,0x56,0x36,0x00,0x00}, /* ';' */
    {0x08,0x14,0x22,0x41,0x00}, /* '<' */
    {0x14,0x14,0x14,0x14,0x14}, /* '=' */
    {0x00,0x41,0x22,0x14,0x08}, /* '>' */
    {0x02,0x01,0x51,0x09,0x06}, /* '?' */
    {0x32,0x49,0x79,0x41,0x3E}, /* '@' */
    {0x7E,0x11,0x11,0x11,0x7E}, /* 'A' */
    {0x7F,0x49,0x49,0x49,0x36}, /* 'B' */
    {0x3E,0x41,0x41,0x41,0x22}, /* 'C' */
    {0x7F,0x41,0x41,0x22,0x1C}, /* 'D' */
    {0x7F,0x49,0x49,0x49,0x41}, /* 'E' */
    {0x7F,0x09,0x09,0x09,0x01}, /* 'F' */
    {0x3E,0x41,0x49,0x49,0x7A}, /* 'G' */
    {0x7F,0x08,0x08,0x08,0x7F}, /* 'H' */
    {0x00,0x41,0x7F,0x41,0x00}, /* 'I' */
    {0x20,0x40,0x41,0x3F,0x01}, /* 'J' */
    {0x7F,0x08,0x14,0x22,0x41}, /* 'K' */
    {0x7F,0x40,0x40,0x40,0x40}, /* 'L' */
    {0x7F,0x02,0x0C,0x02,0x7F}, /* 'M' */
    {0x7F,0x04,0x08,0x10,0x7F}, /* 'N' */
    {0x3E,0x41,0x41,0x41,0x3E}, /* 'O' */
    {0x7F,0x09,0x09,0x09,0x06}, /* 'P' */
    {0x3E,0x41,0x51,0x21,0x5E}, /* 'Q' */
    {0x7F,0x09,0x19,0x29,0x46}, /* 'R' */
    {0x46,0x49,0x49,0x49,0x31}, /* 'S' */
    {0x01,0x01,0x7F,0x01,0x01}, /* 'T' */
    {0x3F,0x40,0x40,0x40,0x3F}, /* 'U' */
    {0x1F,0x20,0x40,0x20,0x1F}, /* 'V' */
    {0x3F,0x40,0x38,0x40,0x3F}, /* 'W' */
    {0x63,0x14,0x08,0x14,0x63}, /* 'X' */
    {0x07,0x08,0x70,0x08,0x07}, /* 'Y' */
    {0x61,0x51,0x49,0x45,0x43}, /* 'Z' */
    {0x00,0x7F,0x41,0x41,0x00}, /* '[' */
    {0x02,0x04,0x08,0x10,0x20}, /* '\\' */
    {0x00,0x41,0x41,0x7F,0x00}, /* ']' */
    {0x04,0x02,0x01,0x02,0x04}, /* '^' */
    {0x40,0x40,0x40,0x40,0x40}, /* '_' */
    {0x00,0x01,0x02,0x04,0x00}, /* '`' */
    {0x20,0x54,0x54,0x54,0x78}, /* 'a' */
    {0x7F,0x48,0x44,0x44,0x38}, /* 'b' */
    {0x38,0x44,0x44,0x44,0x20}, /* 'c' */
    {0x38,0x44,0x44,0x48,0x7F}, /* 'd' */
    {0x38,0x54,0x54,0x54,0x18}, /* 'e' */
    {0x08,0x7E,0x09,0x01,0x02}, /* 'f' */
    {0x0C,0x52,0x52,0x52,0x3E}, /* 'g' */
    {0x7F,0x08,0x04,0x04,0x78}, /* 'h' */
    {0x00,0x44,0x7D,0x40,0x00}, /* 'i' */
    {0x20,0x40,0x44,0x3D,0x00}, /* 'j' */
    {0x7F,0x10,0x28,0x44,0x00}, /* 'k' */
    {0x00,0x41,0x7F,0x40,0x00}, /* 'l' */
    {0x7C,0x04,0x18,0x04,0x78}, /* 'm' */
    {0x7C,0x08,0x04,0x04,0x78}, /* 'n' */
    {0x38,0x44,0x44,0x44,0x38}, /* 'o' */
    {0x7C,0x14,0x14,0x14,0x08}, /* 'p' */
    {0x08,0x14,0x14,0x18,0x7C}, /* 'q' */
    {0x7C,0x08,0x04,0x04,0x08}, /* 'r' */
    {0x48,0x54,0x54,0x54,0x20}, /* 's' */
    {0x04,0x3F,0x44,0x40,0x20}, /* 't' */
    {0x3C,0x40,0x40,0x20,0x7C}, /* 'u' */
    {0x1C,0x20,0x40,0x20,0x1C}, /* 'v' */
    {0x3C,0x40,0x30,0x40,0x3C}, /* 'w' */
    {0x44,0x28,0x10,0x28,0x44}, /* 'x' */
    {0x0C,0x50,0x50,0x50,0x3C}, /* 'y' */
    {0x44,0x64,0x54,0x4C,0x44}, /* 'z' */
    {0x00,0x08,0x36,0x41,0x00}, /* '{' */
    {0x00,0x00,0x7F,0x00,0x00}, /* '|' */
    {0x00,0x41,0x36,0x08,0x00}, /* '}' */
    {0x10,0x08,0x08,0x10,0x08}, /* '~' */
};

/* =========================================================
 *  Delay simple (busy-wait)
 *  Calibrado para ~100 MHz; ajustar si se usa otra frecuencia
 * ========================================================= */

void delay_ms(uint32_t ms) {
    /* ~100000 ciclos por ms a 100 MHz */
    volatile uint32_t count = ms * 10000u;
    while (count--) { __asm volatile("nop"); }
}

/* =========================================================
 *  HAL — SSP0
 * ========================================================= */

/**
 * @brief Inicializa SSP0 en modo SPI Master, CPOL=0, CPHA=0, 8-bit.
 *        Velocidad: PCLK / (CPSDVSR * (SCR+1))
 *        Ejemplo: 60 MHz / (2 * 3) = 10 MHz
 */
static void ssp0_init(void) {
    // 1. Alimentar SSP0 (PCONP bit 21)
    LPC_SC->PCONP |= (1u << 21);

    // 2. PCLK_SSP0 = CCLK
    LPC_SC->PCLKSEL1 &= ~(3u << 20);
    LPC_SC->PCLKSEL1 |=  (1u << 20);   // PCLK = 100 MHz

    // 3. Pines P0.15, P0.17, P0.18 para SSP0
    LPC_PINCON->PINSEL0 &= ~(3u << 30);
    LPC_PINCON->PINSEL0 |=  (2u << 30); // SCK0

