Alvax10/tp-final-ed3-TETRIS/CMSISv2p00_LPC17xx/Drivers/src/tft_ili9341.c
    LPC_PINCON->PINSEL1 &= ~((3u << 2) | (3u << 4));
    LPC_PINCON->PINSEL1 |=  ((2u << 2) | (2u << 4)); // MISO0, MOSI0

    /* 4. Configurar SSP0 */
    LPC_SSP0->CR0  = (7u << 0)   /* DSS: 8-bit */
                   | (0u << 4)   /* FRF: SPI */
                   | (0u << 6)   /* CPOL: idle LOW */
                   | (0u << 7)   /* CPHA: captura en flanco 1 */
                   | (0u << 8);  /* <--- CORREGIDO: SCR = 2 → 100MHz / (2 * (2+1)) = 16.6 MHz */

    LPC_SSP0->CPSR = 2u;         /* CPSDVSR = 2 */

    /* 5. Habilitar Master */
    LPC_SSP0->CR1  = (1u << 1);
}

/**
 * @brief Envía un byte por SSP0 (bloqueante).
 */
static inline void ssp0_send(uint8_t byte) {

    while (!(LPC_SSP0->SR & (1u << 1))){};  /* espera TNF (TX FIFO no lleno) */
    LPC_SSP0->DR = byte;
    while (LPC_SSP0->SR & (1u << 2)) (void)LPC_SSP0->DR; /* drena RX FIFO */
}

/** @brief Limpia lo que termino de recibir
 */
inline void ssp0_flush(void)
{
    while (LPC_SSP0->SR & (1u << 4)) {};    /* espera BSY=0 */
    while (LPC_SSP0->SR & (1u << 2))     /* drena resto de RX */
        (void)LPC_SSP0->DR;
}

/**
 * @brief Envía dos bytes (word RGB565).
 */
static inline void ssp0_send16(uint16_t word) {

    ssp0_send((uint8_t)(word >> 8));
    ssp0_send((uint8_t)(word & 0xFF));
}

/* =========================================================
 *  Inicialización GPIO de control
 * ========================================================= */

static void gpio_ctrl_init(void) {

    GPIO_OUT(TFT_CS_PORT,  TFT_CS_PIN);
    GPIO_OUT(TFT_DC_PORT,  TFT_DC_PIN);
    GPIO_OUT(TFT_RST_PORT, TFT_RST_PIN);
    ssp0_flush();
    TFT_CS_HIGH();
    TFT_DC_HIGH();
    TFT_RST_HIGH();
}

/* =========================================================
 *  ILI9341 — envío de comandos y datos
 * ========================================================= */

static void ili_cmd(uint8_t cmd) {

    TFT_DC_LOW();
    TFT_CS_LOW();
    ssp0_send(cmd);
    ssp0_flush();
    TFT_CS_HIGH();
}

static void ili_data(uint8_t data) {

    TFT_DC_HIGH();
    TFT_CS_LOW();
    ssp0_send(data);
    ssp0_flush();
    TFT_CS_HIGH();
}

static void ili_cmd_data(uint8_t cmd, const uint8_t *buf, uint8_t len) {

    ili_cmd(cmd);
    TFT_DC_HIGH();
    TFT_CS_LOW();
    for (uint8_t i = 0; i < len; i++) {
        ssp0_send(buf[i]);
    }
    ssp0_flush();
    TFT_CS_HIGH();
}

/* =========================================================
 *  Secuencia de inicialización ILI9341
 * ========================================================= */

static void ili9341_hw_init(void) {

    /* Reset hardware */
    TFT_RST_LOW();
    delay_ms(5);
    TFT_RST_HIGH();
    delay_ms(5);

    /* Software reset */
    ili_cmd(ILI9341_SWRESET);
    delay_ms(5);

    /* salir de sleep */
    ili_cmd(ILI9341_SLPOUT);
    delay_ms(5);

    /* Pixel format: 16 bits/pixel (RGB565) */
    uint8_t colmod = 0x55;
    ili_cmd_data(ILI9341_COLMOD, &colmod, 1);

    /* Frame rate: ~70 Hz */
    {
        uint8_t d[] = {0x00, 0x1B};
        ili_cmd_data(ILI9341_FRMCTR1, d, 2);
    }

    /* Power control */
    { uint8_t d[] = {0x23};           ili_cmd_data(ILI9341_PWCTR1, d, 1); }
    { uint8_t d[] = {0x10};           ili_cmd_data(ILI9341_PWCTR2, d, 1); }
    { uint8_t d[] = {0x3E, 0x28};     ili_cmd_data(ILI9341_VMCTR1, d, 2); }
    { uint8_t d[] = {0x86};           ili_cmd_data(ILI9341_VMCTR2, d, 1); }

    /* Interface control: little-endian, RGB */
    { uint8_t d[] = {0x01, 0x30, 0x00}; ili_cmd_data(ILI9341_IFCTL, d, 3); }

    /* Gamma positiva */
    {
        uint8_t d[] = {0x0F,0x31,0x2B,0x0C,0x0E,0x08,0x4E,0xF1,
                        0x37,0x07,0x10,0x03,0x0E,0x09,0x00};
        ili_cmd_data(ILI9341_GMCTRP1, d, 15);
    }
    /* Gamma negativa */
    {
        uint8_t d[] = {0x00,0x0E,0x14,0x03,0x11,0x07,0x31,0xC1,
                        0x48,0x08,0x0F,0x0C,0x31,0x36,0x0F};
        ili_cmd_data(ILI9341_GMCTRN1, d, 15);
    }

    ili_cmd(ILI9341_DISPON);    /* encender pantalla */
}

/* =========================================================
 *  API pública — Inicialización y rotación
 * ========================================================= */

void tft_set_rotation(tft_rotation_t rot) {

    _rotation = rot;
    uint8_t madctl = MADCTL_BGR;

    switch (rot) {
        case TFT_ROT_0:
            madctl |= MADCTL_MX;
            _width  = TFT_WIDTH;
            _height = TFT_HEIGHT;
            break;
        case TFT_ROT_90:
            madctl |= (MADCTL_MV | MADCTL_MX | MADCTL_MY);
            _width  = TFT_HEIGHT;
            _height = TFT_WIDTH;
            break;
        case TFT_ROT_180:
            madctl |= MADCTL_MY;
            _width  = TFT_WIDTH;
            _height = TFT_HEIGHT;
            break;
        case TFT_ROT_270:
            madctl |= MADCTL_MV;
            _width  = TFT_HEIGHT;
            _height = TFT_WIDTH;
            break;
    }
    ili_cmd_data(ILI9341_MADCTL, &madctl, 1);
}

void tft_init(tft_rotation_t rot) {

    gpio_ctrl_init();
    ssp0_init();

    LPC_SC->PCONP |= (1u << 29);      // Habilitar energía del bloque DMA
    LPC_GPDMA->DMACConfig = 1u;       // Habilitar controlador DMA global
    while (!(LPC_GPDMA->DMACConfig & 1u));

    ili9341_hw_init();
    tft_set_rotation(rot);
}

uint16_t tft_width(void)  { return _width;  }
uint16_t tft_height(void) { return _height; }

/* =========================================================
 *  API pública — Primitivas de bajo nivel
 * ========================================================= */

void tft_set_addr_window(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1) {

    /* Column Address Set */
    uint8_t caset[4] = {
        (uint8_t)(x0 >> 8), (uint8_t)(x0),
        (uint8_t)(x1 >> 8), (uint8_t)(x1)
    };
    ili_cmd_data(ILI9341_CASET, caset, 4);

    /* Page Address Set */
    uint8_t paset[4] = {
        (uint8_t)(y0 >> 8), (uint8_t)(y0),
        (uint8_t)(y1 >> 8), (uint8_t)(y1)
    };
    ili_cmd_data(ILI9341_PASET, paset, 4);

    /* Memory Write — habilita escritura continua */
    ili_cmd(ILI9341_RAMWR);
    TFT_DC_HIGH();
    TFT_CS_LOW();
    /* CS queda LOW; el caller llama tft_push_color() y luego CS_HIGH si lo desea */
}

