Alvax10/tp-final-ed3-TETRIS/CMSISv2p00_LPC17xx/Drivers/src/tft_ili9341.c
void tft_push_color(uint16_t color) {

    /* Asume que CS ya está LOW y DC HIGH (tras tft_set_addr_window) */
    ssp0_send16(color);
}

void tft_draw_pixel(int16_t x, int16_t y, uint16_t color) {

    if ((x < 0) || (x >= (int16_t)_width) ||
        (y < 0) || (y >= (int16_t)_height)) return;

    tft_set_addr_window((uint16_t)x, (uint16_t)y,
                         (uint16_t)x, (uint16_t)y);
    ssp0_send16(color);
    ssp0_flush();
    TFT_CS_HIGH();
}

void tft_fill_screen(uint16_t color)
{

    tft_set_addr_window(0, 0, TFT_WIDTH - 1, TFT_HEIGHT - 1);

    const uint8_t hi = (uint8_t)(color >> 8);
    const uint8_t lo = (uint8_t)(color & 0xFF);


    uint32_t blocks = 19200u;

    while (blocks--) {
        /* Esperar FIFO completamente vacía → 8 huecos garantizados */
        while (!(LPC_SSP0->SR & (1u << 0)));  /* TFE */

        /* Volcar 4 píxeles = 8 bytes sin ninguna espera intermedia */
        LPC_SSP0->DR = hi; LPC_SSP0->DR = lo;
        LPC_SSP0->DR = hi; LPC_SSP0->DR = lo;
        LPC_SSP0->DR = hi; LPC_SSP0->DR = lo;
        LPC_SSP0->DR = hi; LPC_SSP0->DR = lo;
    }

    ssp0_flush();
    TFT_CS_HIGH();
}

/* =========================================================
 *  GFX — Líneas
 * ========================================================= */

void gfx_draw_wire_rect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color) {

	tft_set_addr_window(x, y, x + w -1, y);
	for (int16_t i = 0; i < w; i++) ssp0_send16(color);
	tft_set_addr_window(x, y + h -1, x + w -1, y + h -1);
	for (int16_t i = 0; i < w; i++) ssp0_send16(color);
	tft_set_addr_window(x, y, x, y + h -1);
	for (int16_t i = 0; i < h; i++) ssp0_send16(color);
	tft_set_addr_window(x + w -1, y, x + w -1, y + h -1);
	for (int16_t i = 0; i < h; i++) ssp0_send16(color);

	ssp0_flush();
	TFT_CS_HIGH();

}

void gfx_draw_hline(int16_t x, int16_t y, int16_t w, uint16_t color) {

    if (w <= 0) return;
    tft_set_addr_window((uint16_t)x, (uint16_t)y,
                         (uint16_t)(x + w - 1), (uint16_t)y);
    for (int16_t i = 0; i < w; i++) ssp0_send16(color);
    ssp0_flush();
    TFT_CS_HIGH();
}

void gfx_draw_vline(int16_t x, int16_t y, int16_t h, uint16_t color) {

    if (h <= 0) return;
    tft_set_addr_window((uint16_t)x, (uint16_t)y,
                         (uint16_t)x, (uint16_t)(y + h - 1));
    for (int16_t i = 0; i < h; i++) ssp0_send16(color);
    ssp0_flush();
    TFT_CS_HIGH();
}

/* Bresenham genérico */

void gfx_draw_line(int16_t x0, int16_t y0, int16_t x1, int16_t y1, uint16_t color) {

    /* Optimizaciones para líneas axiales */
    if (x0 == x1) { gfx_draw_vline(x0, (y0 < y1 ? y0 : y1), abs(y1 - y0) + 1, color); return; }
    if (y0 == y1) { gfx_draw_hline((x0 < x1 ? x0 : x1), y0, abs(x1 - x0) + 1, color); return; }

    int16_t steep = abs(y1 - y0) > abs(x1 - x0);
    if (steep)   { int16_t t; t=x0; x0=y0; y0=t; t=x1; x1=y1; y1=t; }
    if (x0 > x1) { int16_t t; t=x0; x0=x1; x1=t; t=y0; y0=y1; y1=t; }

    int16_t dx = x1 - x0, dy = abs(y1 - y0);
    int16_t err = dx / 2;
    int16_t ystep = (y0 < y1) ? 1 : -1;

    for (; x0 <= x1; x0++) {
        if (steep) tft_draw_pixel(y0, x0, color);
        else       tft_draw_pixel(x0, y0, color);
        err -= dy;
        if (err < 0) { y0 += ystep; err += dx; }
    }
}

/* =========================================================
 *  GFX — Rectángulos
 * ========================================================= */

uint16_t gfx_get_color_by_enum(uint8_t color_Enum) {

    switch (color_Enum) {

    	case 0:
            return TFT_BLACK; // LA FIGURA I
        case 1:
            return TETRIS_CYAN; // LA FIGURA I
        case 2:
            return TETRIS_AZUL; // LA FIGURA L INVERTIDA
        case 3:
            return TETRIS_NARANJA; // LA FIGURA L
        case 4:
            return TETRIS_AMARILLO; // LA FIGURA CUADRADA
        case 5:
            return TETRIS_VERDE; // LA FIGURA S
        case 6:
            return TETRIS_VIOLETA; // LA FIGURA T
        case 7:
            return TETRIS_ROJO; // ES LA FIGURA Z
        case 8:
            return TETRIS_GRIS;
        case 9:
            return TETRIS_CYAN_SOMBRA;
        case 10:
            return TETRIS_AZUL_SOMBRA;
        case 11:
            return TETRIS_NARANJA_SOMBRA;
        case 12:
            return TETRIS_AMARILLO_SOMBRA;
        case 13:
            return TETRIS_VERDE_SOMBRA;
        case 14:
            return TETRIS_VIOLETA_SOMBRA;
        case 15:
            return TETRIS_ROJO_SOMBRA;
        default:
            return TETRIS_GRIS_SOMBRA;
    }
}

uint16_t gfx_get_color(uint32_t pieza) {

	return gfx_get_color_by_enum(pieza >> 16);

}


void gfx_draw_rect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color) {

    gfx_draw_hline(x, y, w, color);
    gfx_draw_hline(x,y+h-1, w, color);
    gfx_draw_vline(x, y, h, color);
    gfx_draw_vline(x+w-1, y, h, color);
}

void gfx_fill_rect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color)
{
    /* Clipping */
    if ((x >= (int16_t)_width) || (y >= (int16_t)_height)) return;
    if (w <= 0 || h <= 0) return;
    if (x + w > (int16_t)_width)  w = (int16_t)_width  - x;
    if (y + h > (int16_t)_height) h = (int16_t)_height - y;

    /*
     * tft_set_addr_window() deja CS=LOW y DC=HIGH al retornar.
     * No repetir esos pines aquí.
     */
    tft_set_addr_window((uint16_t)x, (uint16_t)y,
                        (uint16_t)(x + w - 1), (uint16_t)(y + h - 1));

    const uint8_t hi = (uint8_t)(color >> 8);
    const uint8_t lo = (uint8_t)(color & 0xFF);
    uint32_t total = (uint32_t)w * (uint32_t)h;

    /*
     * Bloques de 4 píxeles (8 bytes = FIFO llena exacta).
     * Esperar TFE garantiza los 8 huecos antes de cada volcado.
     * El tail maneja los 0–3 píxeles sobrantes byte a byte con TNF.
     */
    while (total >= 4u) {
        while (!(LPC_SSP0->SR & (1u << 0)));  /* TFE: 8 huecos libres */

        LPC_SSP0->DR = hi; LPC_SSP0->DR = lo;
        LPC_SSP0->DR = hi; LPC_SSP0->DR = lo;
        LPC_SSP0->DR = hi; LPC_SSP0->DR = lo;
        LPC_SSP0->DR = hi; LPC_SSP0->DR = lo;

        total -= 4u;
    }

    /* Tail: 0–3 píxeles sobrantes */
    while (total--) {
        while (!(LPC_SSP0->SR & (1u << 1)));  /* TNF */
        LPC_SSP0->DR = hi;
        while (!(LPC_SSP0->SR & (1u << 1)));
        LPC_SSP0->DR = lo;
    }
}

