Alvax10/tp-final-ed3-TETRIS/CMSISv2p00_LPC17xx/Drivers/src/tft_ili9341.c
void gfx_draw_mini_tetris_block(int16_t x, int16_t y, uint32_t dataPieza) {
    uint16_t color;
    int altura = 0;
    int16_t py = 0;
    int16_t px = 0;

    // ESTE NUMERO ES EL SELECTOR DEL COLOR (LOS ULTIMOS 16 BITS DEL "ARRAY"
    color = gfx_get_color(dataPieza);

    for (int i = 0; i < 16; i++) {

        int modulo_4 = i%4;
        if (modulo_4 == 0 && i != 0) {
            altura ++;
        }

        if (dataPieza & (0x8000 >> i)) {
            px = x + (modulo_4 * TAM_MINI_BLOQUE_PX);
            py = y + (altura * TAM_MINI_BLOQUE_PX);
            gfx_draw_wire_rect(px, py, TAM_MINI_BLOQUE_PX, TAM_MINI_BLOQUE_PX, color);
        }
    }

    ssp0_flush();
    TFT_CS_HIGH();
}

void gfx_draw_tetris_block(int16_t x, int16_t y, uint32_t dataPieza) {

    /* Enviar bloque de píxeles en una sola ventana — muy eficiente */
	x = MAPA_X0 + x * TAM_BLOQUE_PX +1;
	y = MAPA_Y0 + y * TAM_BLOQUE_PX +1;

    uint16_t color;
    int altura = 0;
    int16_t py = 0;
    int16_t px = 0;

    // ESTE NUMERO ES EL SELECTOR DEL COLOR (LOS ULTIMOS 16 BITS DEL "ARRAY"
    color = gfx_get_color(dataPieza);

    for (int i = 0; i < 16; i++) {
        int modulo_4 = i%4;
        if (modulo_4 == 0 && i != 0) {
            altura ++;
        }

        if (dataPieza & (0x8000 >> i)) {
            px = x + (modulo_4 * TAM_BLOQUE_PX);
            py = y + (altura * TAM_BLOQUE_PX);
            gfx_draw_wire_rect(px, py, TAM_BLOQUE_PX, TAM_BLOQUE_PX, color);
        }
    }

    ssp0_flush();
    TFT_CS_HIGH();
}

void gfx_fill_tetris_block(int16_t x, int16_t y, uint32_t dataPieza) {

	x = MAPA_X0 + x * TAM_BLOQUE_PX + 1;
	y = MAPA_Y0 + y * TAM_BLOQUE_PX + 1;

    /* Enviar bloque de píxeles en una sola ventana — muy eficiente */
    tft_set_addr_window(x, y,(uint16_t)(x+(TAM_BLOQUE_PX*4)-1), (uint16_t)(y+(TAM_BLOQUE_PX*4)-1));

    uint16_t color;
    int altura = 0;
    int16_t py = 0;
    int16_t px = 0;

    // ESTE NUMERO ES EL SELECTOR DEL COLOR (LOS ULTIMOS 16 BITS DEL "ARRAY"
    color = gfx_get_color(dataPieza);

    for (int i = 0; i < 16; i++) {

        int modulo_4 = i%4;
        if (modulo_4 == 0 && i != 0) {
            altura ++;
        }

        if (dataPieza & (0x8000 >> i)) {
            px = x + (modulo_4 * TAM_BLOQUE_PX);
            py = y + (altura * TAM_BLOQUE_PX);
            gfx_fill_rect(px, py, TAM_BLOQUE_PX, TAM_BLOQUE_PX, color);
        }
    }

    ssp0_flush();
    TFT_CS_HIGH();
}

/* =========================================================
 *  GFX — Círculos (Bresenham)
 * ========================================================= */

static void _draw_circle_helper(int16_t x0, int16_t y0, int16_t r, uint8_t corners, uint16_t color) {

    int16_t f = 1 - r, ddF_x = 1, ddF_y = -2*r;
    int16_t x = 0, y = r;
    while (x < y) {
        if (f >= 0) { y--; ddF_y += 2; f += ddF_y; }
        x++; ddF_x += 2; f += ddF_x;
        if (corners & 0x4) { tft_draw_pixel(x0+x, y0+y, color); tft_draw_pixel(x0+y, y0+x, color); }
        if (corners & 0x2) { tft_draw_pixel(x0+x, y0-y, color); tft_draw_pixel(x0+y, y0-x, color); }
        if (corners & 0x8) { tft_draw_pixel(x0-y, y0+x, color); tft_draw_pixel(x0-x, y0+y, color); }
        if (corners & 0x1) { tft_draw_pixel(x0-y, y0-x, color); tft_draw_pixel(x0-x, y0-y, color); }
    }
}

void gfx_draw_circle(int16_t x0, int16_t y0, int16_t r, uint16_t color) {

    tft_draw_pixel(x0,   y0+r, color);
    tft_draw_pixel(x0,   y0-r, color);
    tft_draw_pixel(x0+r, y0,   color);
    tft_draw_pixel(x0-r, y0,   color);
    _draw_circle_helper(x0, y0, r, 0xF, color);
}

static void _fill_circle_helper(int16_t x0, int16_t y0, int16_t r, uint8_t corners, int16_t delta, uint16_t color) {

    int16_t f = 1 - r, ddF_x = 1, ddF_y = -2*r;
    int16_t x = 0, y = r;
    while (x < y) {
        if (f >= 0) { y--; ddF_y += 2; f += ddF_y; }
        x++; ddF_x += 2; f += ddF_x;
        if (corners & 0x1) {
            gfx_draw_vline(x0+x, y0-y, 2*y+1+delta, color);
            gfx_draw_vline(x0+y, y0-x, 2*x+1+delta, color);
        }
        if (corners & 0x2) {
            gfx_draw_vline(x0-x, y0-y, 2*y+1+delta, color);
            gfx_draw_vline(x0-y, y0-x, 2*x+1+delta, color);
        }
    }
}

void gfx_fill_circle(int16_t x0, int16_t y0, int16_t r, uint16_t color) {

    gfx_draw_vline(x0, y0-r, 2*r+1, color);
    _fill_circle_helper(x0, y0, r, 0x3, 0, color);
}

/* =========================================================
 *  GFX — Triángulos
 * ========================================================= */

void gfx_draw_triangle(int16_t x0, int16_t y0, int16_t x1, int16_t y1, int16_t x2, int16_t y2, uint16_t color) {
    gfx_draw_line(x0, y0, x1, y1, color);
    gfx_draw_line(x1, y1, x2, y2, color);
    gfx_draw_line(x2, y2, x0, y0, color);
}

void gfx_fill_triangle(int16_t x0, int16_t y0, int16_t x1, int16_t y1, int16_t x2, int16_t y2, uint16_t color) {

    /* Ordenar vértices por Y */
    int16_t a, b, y, last;
    if (y0 > y1) { int16_t t; t=x0;x0=x1;x1=t; t=y0;y0=y1;y1=t; }
    if (y1 > y2) { int16_t t; t=x1;x1=x2;x2=t; t=y1;y1=y2;y2=t; }
    if (y0 > y1) { int16_t t; t=x0;x0=x1;x1=t; t=y0;y0=y1;y1=t; }

    if (y0 == y2) {
        a = b = x0;
        if (x1 < a) a = x1; else if (x1 > b) b = x1;
        if (x2 < a) a = x2; else if (x2 > b) b = x2;
        gfx_draw_hline(a, y0, b-a+1, color);
        return;
    }

    int16_t dx01 = x1-x0, dy01 = y1-y0;
    int16_t dx02 = x2-x0, dy02 = y2-y0;
    int16_t dx12 = x2-x1, dy12 = y2-y1;
    int32_t sa = 0, sb = 0;

    last = (y1 == y2) ? y1 : y1 - 1;
    for (y = y0; y <= last; y++) {
        a = x0 + sa / dy01;
        b = x0 + sb / dy02;
        sa += dx01; sb += dx02;
        if (a > b) { int16_t t = a; a = b; b = t; }
        gfx_draw_hline(a, y, b-a+1, color);
    }
    sa = (int32_t)dx12 * (y - y1);
    sb = (int32_t)dx02 * (y - y0);
    for (; y <= y2; y++) {
        a = x1 + sa / dy12;
        b = x0 + sb / dy02;
        sa += dx12; sb += dx02;
        if (a > b) { int16_t t = a; a = b; b = t; }
        gfx_draw_hline(a, y, b-a+1, color);
    }
}

/**
 * @brief Dibuja una estrella rellena de 5 puntas orientada hacia arriba.
 * @param x0 Centro en el eje X
 * @param y0 Centro en el eje Y
 * @param r  Radio exterior (tamaño desde el centro a una punta)
 * @param color Color en formato RGB565
 */

void gfx_fill_star_5pct(int16_t x0, int16_t y0, int16_t r, uint16_t color) {

