Alvax10/tp-final-ed3-TETRIS/CMSISv2p00_LPC17xx/Drivers/src/tft_ili9341.c
    // Radio interior aproximado para una estrella armónica (~38% del exterior)
    int16_t r_in = (r * 38) / 100;
    if (r_in < 1) r_in = 1;

    // Coordenadas precalculadas basadas en aproximaciones trigonométricas fijas (escaladas por r y r_in)
    // Puntas exteriores (0 a 4)
    int16_t ex0 = x0;                         int16_t ey0 = y0 - r;
    int16_t ex1 = x0 + (r * 95) / 100;        int16_t ey1 = y0 - (r * 31) / 100;
    int16_t ex2 = x0 + (r * 59) / 100;        int16_t ey2 = y0 + (r * 81) / 100;
    int16_t ex3 = x0 - (r * 59) / 100;        int16_t ey3 = y0 + (r * 81) / 100;
    int16_t ex4 = x0 - (r * 95) / 100;        int16_t ey4 = y0 - (r * 31) / 100;

    // Valles interiores (0 a 4)
    int16_t ix0 = x0 + (r_in * 59) / 100;     int16_t iy0 = y0 - (r_in * 81) / 100;
    int16_t ix1 = x0 + (r_in * 95) / 100;     int16_t iy1 = y0 + (r_in * 31) / 100;
    int16_t ix2 = x0;                         int16_t iy2 = y0 + r_in;
    int16_t ix3 = x0 - (r_in * 95) / 100;     int16_t iy3 = y0 + (r_in * 31) / 100;
    int16_t ix4 = x0 - (r_in * 59) / 100;     int16_t iy4 = y0 - (r_in * 81) / 100;

    // Dibujar los 5 picos exteriores unidos al centro/valles
    gfx_fill_triangle(ex0, ey0, ix0, iy0, ix4, iy4, color); // Punta Superior
    gfx_fill_triangle(ex1, ey1, ix0, iy0, ix1, iy1, color); // Punta Derecha Superior
    gfx_fill_triangle(ex2, ey2, ix1, iy1, ix2, iy2, color); // Punta Derecha Inferior
    gfx_fill_triangle(ex3, ey3, ix2, iy2, ix3, iy3, color); // Punta Izquierda Inferior
    gfx_fill_triangle(ex4, ey4, ix3, iy3, ix4, iy4, color); // Punta Izquierda Superior

    // Rellenar el pentágono interno central dividiéndolo en 3 triángulos
    gfx_fill_triangle(ix0, iy0, ix1, iy1, ix4, iy4, color);
    gfx_fill_triangle(ix1, iy1, ix3, iy3, ix4, iy4, color);
    gfx_fill_triangle(ix1, iy1, ix2, iy2, ix3, iy3, color);
}

/* =========================================================
 *  GFX — Texto
 * ========================================================= */

void gfx_draw_char(int16_t x, int16_t y, char c,uint16_t fg, uint16_t bg, uint8_t size) {

    if (c < 32 || c > 126) c = '?';
    const uint8_t *glyph = tft_font5x7[(uint8_t)c - 32];

    for (uint8_t col = 0; col < 5; col++) {
        uint8_t bits = glyph[col];
        for (uint8_t row = 0; row < 7; row++) {
            uint16_t color = (bits & 0x01) ? fg : bg;
            if (size == 1) {
                tft_draw_pixel(x + col, y + row, color);
            } else {
                gfx_fill_rect(x + col*size, y + row*size, size, size, color);
            }
            bits >>= 1;
        }
    }
    /* Columna de separación */
    for (uint8_t row = 0; row < 7; row++) {
        if (size == 1) tft_draw_pixel(x + 5, y + row, bg);
        else           gfx_fill_rect(x + 5*size, y + row*size, size, size, bg);
    }
}

void gfx_draw_string(int16_t x, int16_t y, const char *str, uint16_t fg, uint16_t bg, uint8_t size) {

    while (*str) {
        gfx_draw_char(x, y, *str++, fg, bg, size);
        x += 6 * size;  /* 5 px glyph + 1 px gap */
    }
}

void gfx_draw_int(int16_t x, int16_t y, int32_t val, uint16_t fg, uint16_t bg, uint8_t size) {

    char buf[12];
    //snprintf(buf, sizeof(buf), "%ld", (long)val);
    gfx_draw_string(x, y, buf, fg, bg, size);
}
